---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryXRotationFixed
source: html/4d8a41ac-8cf7-b7ab-6d8f-97c7c5cd4996.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryXRotationFixed Property

"X Rotation - Fixed"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryXRotationFixed { get; }
```